Revit 2026 API

# RebarHasPresentationOverrides Method

---

Identifies if this Rebar has overridden default presentation settings for the given view.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasPresentationOverrides(
	View dBView
)
```
```vb
Public Function HasPresentationOverrides (
	dBView As View
) As Boolean
```
```cpp
public:
bool HasPresentationOverrides(
	View^ dBView
)
```
```fsharp
member HasPresentationOverrides :
        dBView : View -> bool
```

#### Parameters

dBView View
     The view.

#### Return Value

Boolean True if this Rebar has overriden default presentation settings, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Default presentation settings can be overriden using SetBarHiddenStatus(View, Int32, Boolean), SetPresentationMode(View, RebarPresentationMode) methods

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace